In [3]:
import pandas as pd
s1=pd.Series([1,2,3])
s1

0    1
1    2
2    3
dtype: int64

In [4]:
s2=pd.Series([1,2,3],index=['a','b','c'])
s2

a    1
b    2
c    3
dtype: int64

In [5]:
data={'Name':['Alice','Bob','Nimal'],'Age':[25,30,24]}
df=pd.DataFrame(data)
df

    Name  Age
0  Alice   25
1    Bob   30
2  Nimal   24

In [8]:
list_of_dicts=[{'column_a':1,'column_b':2,'column_c':3},
              {'column_a':10,'column_b':20,'column_c':30}]
df=pd.DataFrame(list_of_dicts,index=['row1','row2'])
df

      column_a  column_b  column_c
row1         1         2         3
row2        10        20        30

In [9]:
list_of_tuples=[(8,'August',1998),(2,'January',1987),
               (17,'July',2021),(12,'February',2001)]
df=pd.DataFrame(list_of_tuples,columns=['Date','Month','Year'])
df

   Date     Month  Year
0     8    August  1998
1     2   January  1987
2    17      July  2021
3    12  February  2001

In [11]:
students=['Alan','Vivian','Alister','Jade']
age=[24,67,43,12]
list_of_tuples=list(zip(students,age))
df=pd.DataFrame(list_of_tuples,columns=['Name','Age'])
df

      Name  Age
0     Alan   24
1   Vivian   67
2  Alister   43
3     Jade   12

In [16]:
print(df.head())
print('########')
print(df.info())
print('########')
print(df.shape)
print('########')
print(df.describe())
print('########')
print(df.columns)
print('########')
print(df.index)
print('########')
print(df.values)

      Name  Age
0     Alan   24
1   Vivian   67
2  Alister   43
3     Jade   12
########
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    4 non-null      object
 1   Age     4 non-null      int64
dtypes: int64(1), object(1)
memory usage: 192.0+ bytes
None
########
(4, 2)
########
             Age
count   4.000000
mean   36.500000
std    24.006943
min    12.000000
25%    21.000000
50%    33.500000
75%    49.000000
max    67.000000
########
Index(['Name', 'Age'], dtype='object')
########
RangeIndex(start=0, stop=4, step=1)
########
[['Alan' 24]
 ['Vivian' 67]
 ['Alister' 43]
 ['Jade' 12]]

In [17]:
list_of_data=[('Alice',25,85,'New York'),('Bob',30,70,'Los Angeles'),
             ('Charlie',22,90,'Frankfurt'),('David',28,80,'London'),
             ('Karl',19,75,'Oslo'),('Amile',22,77,'Barcelona'),("Daminan",27,82,'Frankfurt')]
df=pd.DataFrame(list_of_data,columns=['Name','Age','Score','City'])
df

      Name  Age  Score         City
0    Alice   25     85     New York
1      Bob   30     70  Los Angeles
2  Charlie   22     90    Frankfurt
3    David   28     80       London
4     Karl   19     75         Oslo
5    Amile   22     77    Barcelona
6  Daminan   27     82    Frankfurt

In [20]:
selected_data1=df['Name']
print(selected_data1)
selected_data2=df[['Name','Score']]
print(selected_data2)

0      Alice
1        Bob
2    Charlie
3      David
4       Karl
5      Amile
6    Daminan
Name: Name, dtype: object
      Name  Score
0    Alice     85
1      Bob     70
2  Charlie     90
3    David     80
4     Karl     75
5    Amile     77
6  Daminan     82

In [24]:
selected_df3=df[0:2]
selected_df4=df.iloc[:,1:3]
print(selected_df3)
print(selected_df4)

    Name  Age  Score         City
0  Alice   25     85     New York
1    Bob   30     70  Los Angeles
   Age  Score
0   25     85
1   30     70
2   22     90
3   28     80
4   19     75
5   22     77
6   27     82

In [25]:
selected_df5=df.loc[:,['Name','City']]
selected_df5

      Name         City
0    Alice     New York
1      Bob  Los Angeles
2  Charlie    Frankfurt
3    David       London
4     Karl         Oslo
5    Amile    Barcelona
6  Daminan    Frankfurt

In [28]:
raw_data={'first_name':['Sheldon','Raj','Leonard','Howard','Amy'],
         'last_name':['Copper','Koothrappali','Hofstadter','Wolwitz','Fowler'],
         'age':[42,38,36,41,35],
         'comedy_score':[9,7,8,8,5],
         'rating_score':[25,25,49,62,70]}
df=pd.DataFrame(raw_data,columns=['first_name','last_name','age','comedy_score','rating_score'])
df

  first_name     last_name  age  comedy_score  rating_score
0    Sheldon        Copper   42             9            25
1        Raj  Koothrappali   38             7            25
2    Leonard    Hofstadter   36             8            49
3     Howard       Wolwitz   41             8            62
4        Amy        Fowler   35             5            70

In [31]:
print(df.sort_values(by='age',ascending=0))
print()
print(df.sort_values(by='age',ascending=1))
print()
print(df.sort_values(by=['age','comedy_score']))
print()

  first_name     last_name  age  comedy_score  rating_score
0    Sheldon        Copper   42             9            25
3     Howard       Wolwitz   41             8            62
1        Raj  Koothrappali   38             7            25
2    Leonard    Hofstadter   36             8            49
4        Amy        Fowler   35             5            70

  first_name     last_name  age  comedy_score  rating_score
4        Amy        Fowler   35             5            70
2    Leonard    Hofstadter   36             8            49
1        Raj  Koothrappali   38             7            25
3     Howard       Wolwitz   41             8            62
0    Sheldon        Copper   42             9            25

  first_name     last_name  age  comedy_score  rating_score
4        Amy        Fowler   35             5            70
2    Leonard    Hofstadter   36             8            49
1        Raj  Koothrappali   38             7            25
3     Howard       Wolwitz   41             8            62
0    Sheldon        Copper   42             9            25

In [33]:
group=df.groupby(['age'])
print(group)
print(group.size())

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x000001F8C17806D0>
age
35    1
36    1
38    1
41    1
42    1
dtype: int64

In [34]:
group=df.groupby(['comedy_score','first_name'])
print(group)
print(group.size())

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x000001F8C1780550>
comedy_score  first_name
5             Amy           1
7             Raj           1
8             Howard        1
              Leonard       1
9             Sheldon       1
dtype: int64

In [38]:
print('Index of largest value:');print(df['age'].idxmax())
print('Index of l value:');print(df['age'].idxmax())

Index of largest value:
0